lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_STM32F107.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_STM32F107.c
 *      Purpose: CAN Driver, Hardware specific module for ST STM32F105/7
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <stm32f10x_cl.h>             /* STM32F105/7 register definitions    */


#define __CTRL1                 1
#define __CTRL2                 2

#define __FILTER_BANK_MAX      27     /* filter banks 0..27 */


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as PCLK1
#define CAN_CLK               36000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static      void CAN_set_timing      (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp)
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_testmode     (U32 ctrl, U32 testmode)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl,         CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, U32 ch, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl,         CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuction
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd            (U32 ctrl, U32 ch, CAN_msg *msg);
static BOOL CAN_hw_rx_object_chk (U32 ctrl, U16 bank,         U32 object_para);
static void CAN_hw_rx_object_add (U32 ctrl, U16 bank, U32 id, U32 object_para);

/* CAN Controller Register Addresses                                         */
CAN_TypeDef *CAN_CTRL[] = { CAN1, CAN2 };

/* Static variables used only in this module                                 */
static U16 CAN1_filterIdx = 0;
static U16 CAN2_filterIdx = 0;

/************************* Auxiliary Functions *******************************/

/*--------------------------- CAN_set_timing --------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              tseg1:      Specifies Time Segment before the sample point
 *              tseg2:      Time Segment after the sample point
 *              sjw:        Synchronisation Jump Width
 *              brp:        Baud Rate Prescaler
 *
 *---------------------------------------------------------------------------*/

static void CAN_set_timing (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp) {
  CAN_TypeDef *CANx = CAN_CTRL[ctrl-1];

  CANx->BTR &= ~(((          0x03) << 24) | ((            0x07) << 20) | ((            0x0F) << 16) | (          0x3FF));
  CANx->BTR |=  ((((sjw-1) & 0x03) << 24) | (((tseg2-1) & 0x07) << 20) | (((tseg1-1) & 0x0F) << 16) | ((brp-1) & 0x3FF));
}


/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 brp;

  /* Note: this calculations fit for PCLK1 = 36MHz */
  /* Determine which nominal time to use for requested baudrate and set
     appropriate bit timing                                                  */
  if (baudrate <= 500000)  {
    brp  = (CAN_CLK / 18) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 12, TSEG2 = 5, SJW = 4 => 1 CAN bit = 18 TQ, sample at 72%    */
    CAN_set_timing(ctrl, 12, 5, 4, brp);
  }  else if (baudrate <= 1000000)  {
    brp  = (CAN_CLK / 9) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 5, TSEG2 = 3, SJW = 3 => 1 CAN bit = 9 TQ, sample at 66%      */
    CAN_set_timing(ctrl,  5, 3, 3, brp);
  }  else  {
    return CAN_BAUDRATE_ERROR;
  }

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {

  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1
        /* Enable clock for CAN1, GPIOD and AFIO */
        RCC->APB1ENR |= (1 << 25);
        RCC->APB2ENR |= (1 <<  5) | (1 <<  0);
        /* CAN1 remap, use PD0, PD1 */
        AFIO->MAPR   |= 0x00006000;
        GPIOD->CRL   &= 0xFFFFFF00;
        GPIOD->CRL   |= 0x000000B8;
        /* Enable CAN1 interrupts */
        NVIC->IP[4]  |= 0x10000000;                  // set priority
        NVIC->IP[5]  |= 0x00000010;                  // set priority
        NVIC->ISER[0] = (1 << 20) | (1 << 19);       // enable interrupt
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        /* Enable clock for CAN2, GPIOB and AFIO */
        RCC->APB1ENR |= (1 << 25) | (1 << 26);
        RCC->APB2ENR |= (1 <<  3) | (1 <<  0);
        /* CAN2 remap, use PB5, PB6 */
        AFIO->MAPR   |= 0x00400000;
        GPIOB->CRL   &= 0xF00FFFFF;
        GPIOB->CRL   |= 0x0B800000;
        /* Enable CAN2 interrupts */
        NVIC->IP[15] |= 0x10000000;                  // set priority
        NVIC->IP[16] |= 0x00000010;                  // set priority
        NVIC->ISER[1] = 1U << 31;                    // enable interrupt
        NVIC->ISER[2] = 1 << 0;                      // enable interrupt
      #endif
      break;
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

