lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_STM32F107.c
      for (CAN_filterBnk = __FILTER_BANK_MAX; CAN_filterBnk > CAN_filterIdx; CAN_filterBnk--) {
        if (CAN_hw_rx_object_chk (ctrl, CAN_filterBnk, object_para) == __TRUE) {
          CAN_hw_rx_object_add (ctrl, CAN_filterBnk, id, object_para);
          break;                                    /* stop the loop if we have added the object */
        }
      }
      break;
  }

  if (CAN_filterBnk != CAN_filterIdx)
    return CAN_OK;
  else
    return CAN_OBJECTS_FULL_ERROR;

}


/*--------------------------- CAN_hw_tx_object ------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  transmission, the setup of transmission object is not necessery so this 
 *  function is not implemented
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Index of object used for transmission
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {

  return CAN_NOT_IMPLEMENTED_ERROR;
}


/************************* Interrupt Functions *******************************/

/*--------------------------- CAN_IRQ_Handler -------------------------------
 *
 *  CAN interrupt function 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *---------------------------------------------------------------------------*/

void CAN1_TX_IRQHandler (void) {
  CAN_msg *ptrmsg;

  if (CAN1->TSR & (1 << 0)) {                     /* request completed mbx 0 */
    CAN1->TSR |= (1 << 0);                   /* reset request complete mbx 0 */

    /* If there is a message in the mailbox ready for send, read the 
       message from the mailbox and send it                                  */
    if (isr_mbx_receive (MBX_tx_ctrl[__CTRL1-1], (void **)&ptrmsg) != OS_R_OK) {

      CAN_hw_wr (__CTRL1, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
    } else {
      isr_sem_send(wr_sem[__CTRL1-1]);   /* Return a token back to semaphore */

      CAN1->IER &= ~(1 << 0);                      /* disable  TME interrupt */ 
    }
  }
}

void CAN1_RX0_IRQHandler (void) {
  CAN_msg *ptrmsg;

  if (CAN1->RF0R & 3) {                                 /* message pending ? */
    /* If the mailbox isn't full read the message from the hardware and
       send it to the message queue                                          */
    if (isr_mbx_check (MBX_rx_ctrl[__CTRL1-1]) > 0)  {

      ptrmsg = _alloc_box (CAN_mpool);
      if (ptrmsg) {
        CAN_hw_rd (__CTRL1, 0, ptrmsg);             /* Read received message */
        isr_mbx_send (MBX_rx_ctrl[__CTRL1-1], ptrmsg);
      }
    }
    CAN1->RF0R |= (1 << 5);                 /* Release FIFO 0 output mailbox */
  }
}

void CAN2_TX_IRQHandler (void) {
  CAN_msg *ptrmsg;

  if (CAN2->TSR & (1 << 0)) {                     /* request completed mbx 0 */
    CAN2->TSR |= (1 << 0);                   /* reset request complete mbx 0 */

    /* If there is a message in the mailbox ready for send, read the 
       message from the mailbox and send it                                  */
    if (isr_mbx_receive (MBX_tx_ctrl[__CTRL2-1], (void **)&ptrmsg) != OS_R_OK) {

      CAN_hw_wr (__CTRL2, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
    } else {
      isr_sem_send(wr_sem[__CTRL2-1]);   /* Return a token back to semaphore */

      CAN2->IER &= ~(1 << 0);                      /* disable  TME interrupt */ 
    }
  }
}

void CAN2_RX0_IRQHandler (void) {
  CAN_msg *ptrmsg;

  if (CAN2->RF0R & 3) {                                 /* message pending ? */
    /* If the mailbox isn't full read the message from the hardware and
       send it to the message queue                                          */
    if (isr_mbx_check (MBX_rx_ctrl[__CTRL2-1]) > 0)  {

      ptrmsg = _alloc_box (CAN_mpool);
      if (ptrmsg) {
        CAN_hw_rd (__CTRL2, 0, ptrmsg);             /* Read received message */
        isr_mbx_send (MBX_rx_ctrl[__CTRL2-1], ptrmsg);
      }
    }
    CAN2->RF0R |= (1 << 5);                 /* Release FIFO 0 output mailbox */
  }
}

/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/
